# 打印一个由*构成的四行四列的长方形
for i in range(1, 5):
    for j in range(1, 5):
        print('*', end=" ")
    print()
print("--------------------------------------------------------------------------------------------------------------")
# 在不打'e nd=“'的情况下会怎么样？
for i in range(1, 5):
    for j in range(1, 5):
        print('*')
    print()
'''
总结；因为我们需要*是打印在同一行，print默认打印一次是end='/n'也就是换行，所以我们需要手动声明故print('*',end='')
'''
print("--------------------------------------------------------------------------------------------------------------")
# 输出一个直角三角形
# 例一自写，繁杂，自动化程度不高。
for i in range(1, 2):
    for j in range(1, 2):
        print('*')
    for j in range(1, 3):
        print('*', end='')
    print()
    for j in range(1, 4):
        print('*', end='')
    print()
    for j in range(1, 5):
        print('*', end='')
    print()
    for j in range(1, 6):
        print('*', end='')
    print()
print("--------------------------------------------------------------------------------------------------------------")
# 例二 跟学练习
s = 6
for i in range(1, s):
    for j in range(1, i + 1):
        print('*', end='')
    print()
print("--------------------------------------------------------------------------------------------------------------")
# 输出一个倒直角三角形
for i in range(1, 7):
    for j in range(1, 7 - i):
        print('*', end='')
    print()
print("--------------------------------------------------------------------------------------------------------------")
# 输出一个等腰三角形
for i in range(1, 6):
    for j in range(1, 6 - i):
        print(' ', end='')
    for k in range(1, i * 2):
        print('*', end='')
    print()
